:PROPERTIES:
:ID:       db7c599c-5088-4738-9eff-1d4b65091119
:END:
#+title: fun
#+date: [2024-12-01 Sun 11:51]
#+startup: overview

- used for anonymous functions
#+begin_src ocaml
(fun x -> x * x) 50;;
#+end_src

#+RESULTS:
: 2500
